zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/afec.h
/**
 * \file
 *
 * \brief Component description for AFEC
 *
 * Copyright (c) 2018 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-08-25T14:00:00Z */
#ifndef _SAME70_AFEC_COMPONENT_H_
#define _SAME70_AFEC_COMPONENT_H_
#define _SAME70_AFEC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAME_SAME70 Analog Front-End Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AFEC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define AFEC_11147                      /**< (AFEC) Module ID */
#define REV_AFEC M                      /**< (AFEC) Module revision */

/* -------- AFEC_CR : (AFEC Offset: 0x00) (/W 32) AFEC Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SWRST:1;                   /**< bit:      0  Software Reset                           */
    uint32_t START:1;                   /**< bit:      1  Start Conversion                         */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CR_OFFSET                      (0x00)                                        /**<  (AFEC_CR) AFEC Control Register  Offset */

#define AFEC_CR_SWRST_Pos                   0                                              /**< (AFEC_CR) Software Reset Position */
#define AFEC_CR_SWRST_Msk                   (_U_(0x1) << AFEC_CR_SWRST_Pos)                /**< (AFEC_CR) Software Reset Mask */
#define AFEC_CR_SWRST                       AFEC_CR_SWRST_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CR_SWRST_Msk instead */
#define AFEC_CR_START_Pos                   1                                              /**< (AFEC_CR) Start Conversion Position */
#define AFEC_CR_START_Msk                   (_U_(0x1) << AFEC_CR_START_Pos)                /**< (AFEC_CR) Start Conversion Mask */
#define AFEC_CR_START                       AFEC_CR_START_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CR_START_Msk instead */
#define AFEC_CR_MASK                        _U_(0x03)                                      /**< \deprecated (AFEC_CR) Register MASK  (Use AFEC_CR_Msk instead)  */
#define AFEC_CR_Msk                         _U_(0x03)                                      /**< (AFEC_CR) Register Mask  */


/* -------- AFEC_MR : (AFEC Offset: 0x04) (R/W 32) AFEC Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TRGEN:1;                   /**< bit:      0  Trigger Enable                           */
    uint32_t TRGSEL:3;                  /**< bit:   1..3  Trigger Selection                        */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t SLEEP:1;                   /**< bit:      5  Sleep Mode                               */
    uint32_t FWUP:1;                    /**< bit:      6  Fast Wake-up                             */
    uint32_t FREERUN:1;                 /**< bit:      7  Free Run Mode                            */
    uint32_t PRESCAL:8;                 /**< bit:  8..15  Prescaler Rate Selection                 */
    uint32_t STARTUP:4;                 /**< bit: 16..19  Start-up Time                            */
    uint32_t :3;                        /**< bit: 20..22  Reserved */
    uint32_t ONE:1;                     /**< bit:     23  One                                      */
    uint32_t TRACKTIM:4;                /**< bit: 24..27  Tracking Time                            */
    uint32_t TRANSFER:2;                /**< bit: 28..29  Transfer Period                          */
    uint32_t :1;                        /**< bit:     30  Reserved */
    uint32_t USEQ:1;                    /**< bit:     31  User Sequence Enable                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_MR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_MR_OFFSET                      (0x04)                                        /**<  (AFEC_MR) AFEC Mode Register  Offset */

#define AFEC_MR_TRGEN_Pos                   0                                              /**< (AFEC_MR) Trigger Enable Position */
#define AFEC_MR_TRGEN_Msk                   (_U_(0x1) << AFEC_MR_TRGEN_Pos)                /**< (AFEC_MR) Trigger Enable Mask */
#define AFEC_MR_TRGEN                       AFEC_MR_TRGEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_MR_TRGEN_Msk instead */
#define   AFEC_MR_TRGEN_DIS_Val             _U_(0x0)                                       /**< (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software.  */
#define   AFEC_MR_TRGEN_EN_Val              _U_(0x1)                                       /**< (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled.  */
#define AFEC_MR_TRGEN_DIS                   (AFEC_MR_TRGEN_DIS_Val << AFEC_MR_TRGEN_Pos)   /**< (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software. Position  */
#define AFEC_MR_TRGEN_EN                    (AFEC_MR_TRGEN_EN_Val << AFEC_MR_TRGEN_Pos)    /**< (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled. Position  */
#define AFEC_MR_TRGSEL_Pos                  1                                              /**< (AFEC_MR) Trigger Selection Position */
#define AFEC_MR_TRGSEL_Msk                  (_U_(0x7) << AFEC_MR_TRGSEL_Pos)               /**< (AFEC_MR) Trigger Selection Mask */
#define AFEC_MR_TRGSEL(value)               (AFEC_MR_TRGSEL_Msk & ((value) << AFEC_MR_TRGSEL_Pos))
#define   AFEC_MR_TRGSEL_AFEC_TRIG0_Val     _U_(0x0)                                       /**< (AFEC_MR) AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG1_Val     _U_(0x1)                                       /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG2_Val     _U_(0x2)                                       /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG3_Val     _U_(0x3)                                       /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG4_Val     _U_(0x4)                                       /**< (AFEC_MR) PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG5_Val     _U_(0x5)                                       /**< (AFEC_MR) PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG6_Val     _U_(0x6)                                       /**< (AFEC_MR) Analog Comparator  */
#define AFEC_MR_TRGSEL_AFEC_TRIG0           (AFEC_MR_TRGSEL_AFEC_TRIG0_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG1           (AFEC_MR_TRGSEL_AFEC_TRIG1_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG2           (AFEC_MR_TRGSEL_AFEC_TRIG2_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG3           (AFEC_MR_TRGSEL_AFEC_TRIG3_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG4           (AFEC_MR_TRGSEL_AFEC_TRIG4_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG5           (AFEC_MR_TRGSEL_AFEC_TRIG5_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG6           (AFEC_MR_TRGSEL_AFEC_TRIG6_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) Analog Comparator Position  */
#define AFEC_MR_SLEEP_Pos                   5                                              /**< (AFEC_MR) Sleep Mode Position */
#define AFEC_MR_SLEEP_Msk                   (_U_(0x1) << AFEC_MR_SLEEP_Pos)                /**< (AFEC_MR) Sleep Mode Mask */
#define AFEC_MR_SLEEP                       AFEC_MR_SLEEP_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_MR_SLEEP_Msk instead */
#define   AFEC_MR_SLEEP_NORMAL_Val          _U_(0x0)                                       /**< (AFEC_MR) Normal mode: The AFE and reference voltage circuitry are kept ON between conversions.  */
#define   AFEC_MR_SLEEP_SLEEP_Val           _U_(0x1)                                       /**< (AFEC_MR) Sleep mode: The AFE and reference voltage circuitry are OFF between conversions.  */
#define AFEC_MR_SLEEP_NORMAL                (AFEC_MR_SLEEP_NORMAL_Val << AFEC_MR_SLEEP_Pos)  /**< (AFEC_MR) Normal mode: The AFE and reference voltage circuitry are kept ON between conversions. Position  */
#define AFEC_MR_SLEEP_SLEEP                 (AFEC_MR_SLEEP_SLEEP_Val << AFEC_MR_SLEEP_Pos)  /**< (AFEC_MR) Sleep mode: The AFE and reference voltage circuitry are OFF between conversions. Position  */
#define AFEC_MR_FWUP_Pos                    6                                              /**< (AFEC_MR) Fast Wake-up Position */
#define AFEC_MR_FWUP_Msk                    (_U_(0x1) << AFEC_MR_FWUP_Pos)                 /**< (AFEC_MR) Fast Wake-up Mask */
#define AFEC_MR_FWUP                        AFEC_MR_FWUP_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_MR_FWUP_Msk instead */
#define   AFEC_MR_FWUP_OFF_Val              _U_(0x0)                                       /**< (AFEC_MR) Normal Sleep mode: The sleep mode is defined by the SLEEP bit.  */
#define   AFEC_MR_FWUP_ON_Val               _U_(0x1)                                       /**< (AFEC_MR) Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF.  */
#define AFEC_MR_FWUP_OFF                    (AFEC_MR_FWUP_OFF_Val << AFEC_MR_FWUP_Pos)     /**< (AFEC_MR) Normal Sleep mode: The sleep mode is defined by the SLEEP bit. Position  */
#define AFEC_MR_FWUP_ON                     (AFEC_MR_FWUP_ON_Val << AFEC_MR_FWUP_Pos)      /**< (AFEC_MR) Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF. Position  */
#define AFEC_MR_FREERUN_Pos                 7                                              /**< (AFEC_MR) Free Run Mode Position */
#define AFEC_MR_FREERUN_Msk                 (_U_(0x1) << AFEC_MR_FREERUN_Pos)              /**< (AFEC_MR) Free Run Mode Mask */
#define AFEC_MR_FREERUN                     AFEC_MR_FREERUN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_MR_FREERUN_Msk instead */
#define   AFEC_MR_FREERUN_OFF_Val           _U_(0x0)                                       /**< (AFEC_MR) Normal mode  */
#define   AFEC_MR_FREERUN_ON_Val            _U_(0x1)                                       /**< (AFEC_MR) Free Run mode: Never wait for any trigger.  */
#define AFEC_MR_FREERUN_OFF                 (AFEC_MR_FREERUN_OFF_Val << AFEC_MR_FREERUN_Pos)  /**< (AFEC_MR) Normal mode Position  */
#define AFEC_MR_FREERUN_ON                  (AFEC_MR_FREERUN_ON_Val << AFEC_MR_FREERUN_Pos)  /**< (AFEC_MR) Free Run mode: Never wait for any trigger. Position  */
#define AFEC_MR_PRESCAL_Pos                 8                                              /**< (AFEC_MR) Prescaler Rate Selection Position */
#define AFEC_MR_PRESCAL_Msk                 (_U_(0xFF) << AFEC_MR_PRESCAL_Pos)             /**< (AFEC_MR) Prescaler Rate Selection Mask */
#define AFEC_MR_PRESCAL(value)              (AFEC_MR_PRESCAL_Msk & ((value) << AFEC_MR_PRESCAL_Pos))
#define AFEC_MR_STARTUP_Pos                 16                                             /**< (AFEC_MR) Start-up Time Position */
#define AFEC_MR_STARTUP_Msk                 (_U_(0xF) << AFEC_MR_STARTUP_Pos)              /**< (AFEC_MR) Start-up Time Mask */
#define AFEC_MR_STARTUP(value)              (AFEC_MR_STARTUP_Msk & ((value) << AFEC_MR_STARTUP_Pos))
#define   AFEC_MR_STARTUP_SUT0_Val          _U_(0x0)                                       /**< (AFEC_MR) 0 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT8_Val          _U_(0x1)                                       /**< (AFEC_MR) 8 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT16_Val         _U_(0x2)                                       /**< (AFEC_MR) 16 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT24_Val         _U_(0x3)                                       /**< (AFEC_MR) 24 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT64_Val         _U_(0x4)                                       /**< (AFEC_MR) 64 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT80_Val         _U_(0x5)                                       /**< (AFEC_MR) 80 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT96_Val         _U_(0x6)                                       /**< (AFEC_MR) 96 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT112_Val        _U_(0x7)                                       /**< (AFEC_MR) 112 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT512_Val        _U_(0x8)                                       /**< (AFEC_MR) 512 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT576_Val        _U_(0x9)                                       /**< (AFEC_MR) 576 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT640_Val        _U_(0xA)                                       /**< (AFEC_MR) 640 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT704_Val        _U_(0xB)                                       /**< (AFEC_MR) 704 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT768_Val        _U_(0xC)                                       /**< (AFEC_MR) 768 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT832_Val        _U_(0xD)                                       /**< (AFEC_MR) 832 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT896_Val        _U_(0xE)                                       /**< (AFEC_MR) 896 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT960_Val        _U_(0xF)                                       /**< (AFEC_MR) 960 periods of AFE clock  */
#define AFEC_MR_STARTUP_SUT0                (AFEC_MR_STARTUP_SUT0_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 0 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT8                (AFEC_MR_STARTUP_SUT8_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 8 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT16               (AFEC_MR_STARTUP_SUT16_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 16 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT24               (AFEC_MR_STARTUP_SUT24_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 24 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT64               (AFEC_MR_STARTUP_SUT64_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 64 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT80               (AFEC_MR_STARTUP_SUT80_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 80 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT96               (AFEC_MR_STARTUP_SUT96_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 96 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT112              (AFEC_MR_STARTUP_SUT112_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 112 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT512              (AFEC_MR_STARTUP_SUT512_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 512 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT576              (AFEC_MR_STARTUP_SUT576_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 576 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT640              (AFEC_MR_STARTUP_SUT640_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 640 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT704              (AFEC_MR_STARTUP_SUT704_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 704 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT768              (AFEC_MR_STARTUP_SUT768_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 768 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT832              (AFEC_MR_STARTUP_SUT832_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 832 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT896              (AFEC_MR_STARTUP_SUT896_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 896 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT960              (AFEC_MR_STARTUP_SUT960_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 960 periods of AFE clock Position  */
#define AFEC_MR_ONE_Pos                     23                                             /**< (AFEC_MR) One Position */
#define AFEC_MR_ONE_Msk                     (_U_(0x1) << AFEC_MR_ONE_Pos)                  /**< (AFEC_MR) One Mask */
#define AFEC_MR_ONE                         AFEC_MR_ONE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_MR_ONE_Msk instead */
#define AFEC_MR_TRACKTIM_Pos                24                                             /**< (AFEC_MR) Tracking Time Position */
#define AFEC_MR_TRACKTIM_Msk                (_U_(0xF) << AFEC_MR_TRACKTIM_Pos)             /**< (AFEC_MR) Tracking Time Mask */
#define AFEC_MR_TRACKTIM(value)             (AFEC_MR_TRACKTIM_Msk & ((value) << AFEC_MR_TRACKTIM_Pos))
#define AFEC_MR_TRANSFER_Pos                28                                             /**< (AFEC_MR) Transfer Period Position */
#define AFEC_MR_TRANSFER_Msk                (_U_(0x3) << AFEC_MR_TRANSFER_Pos)             /**< (AFEC_MR) Transfer Period Mask */
#define AFEC_MR_TRANSFER(value)             (AFEC_MR_TRANSFER_Msk & ((value) << AFEC_MR_TRANSFER_Pos))
#define AFEC_MR_USEQ_Pos                    31                                             /**< (AFEC_MR) User Sequence Enable Position */
#define AFEC_MR_USEQ_Msk                    (_U_(0x1) << AFEC_MR_USEQ_Pos)                 /**< (AFEC_MR) User Sequence Enable Mask */
#define AFEC_MR_USEQ                        AFEC_MR_USEQ_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_MR_USEQ_Msk instead */
#define   AFEC_MR_USEQ_NUM_ORDER_Val        _U_(0x0)                                       /**< (AFEC_MR) Normal mode: The controller converts channels in a simple numeric order.  */
#define   AFEC_MR_USEQ_REG_ORDER_Val        _U_(0x1)                                       /**< (AFEC_MR) User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R.  */
#define AFEC_MR_USEQ_NUM_ORDER              (AFEC_MR_USEQ_NUM_ORDER_Val << AFEC_MR_USEQ_Pos)  /**< (AFEC_MR) Normal mode: The controller converts channels in a simple numeric order. Position  */
#define AFEC_MR_USEQ_REG_ORDER              (AFEC_MR_USEQ_REG_ORDER_Val << AFEC_MR_USEQ_Pos)  /**< (AFEC_MR) User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R. Position  */
#define AFEC_MR_MASK                        _U_(0xBF8FFFEF)                                /**< \deprecated (AFEC_MR) Register MASK  (Use AFEC_MR_Msk instead)  */
#define AFEC_MR_Msk                         _U_(0xBF8FFFEF)                                /**< (AFEC_MR) Register Mask  */


/* -------- AFEC_EMR : (AFEC Offset: 0x08) (R/W 32) AFEC Extended Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMPMODE:2;                 /**< bit:   0..1  Comparison Mode                          */
    uint32_t :1;                        /**< bit:      2  Reserved */
    uint32_t CMPSEL:5;                  /**< bit:   3..7  Comparison Selected Channel              */
    uint32_t :1;                        /**< bit:      8  Reserved */
    uint32_t CMPALL:1;                  /**< bit:      9  Compare All Channels                     */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t CMPFILTER:2;               /**< bit: 12..13  Compare Event Filtering                  */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t RES:3;                     /**< bit: 16..18  Resolution                               */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t TAG:1;                     /**< bit:     24  TAG of the AFEC_LDCR                     */
    uint32_t STM:1;                     /**< bit:     25  Single Trigger Mode                      */
    uint32_t :2;                        /**< bit: 26..27  Reserved */
    uint32_t SIGNMODE:2;                /**< bit: 28..29  Sign Mode                                */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_EMR_Type;
