zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/afec.h
/* -------- AFEC_CHDR : (AFEC Offset: 0x18) (/W 32) AFEC Channel Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Disable                        */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Disable                        */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Disable                        */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Disable                        */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Disable                        */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Disable                        */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Disable                        */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Disable                        */
    uint32_t CH8:1;                     /**< bit:      8  Channel 8 Disable                        */
    uint32_t CH9:1;                     /**< bit:      9  Channel 9 Disable                        */
    uint32_t CH10:1;                    /**< bit:     10  Channel 10 Disable                       */
    uint32_t CH11:1;                    /**< bit:     11  Channel 11 Disable                       */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:12;                     /**< bit:  0..11  Channel xx Disable                       */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CHDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CHDR_OFFSET                    (0x18)                                        /**<  (AFEC_CHDR) AFEC Channel Disable Register  Offset */

#define AFEC_CHDR_CH0_Pos                   0                                              /**< (AFEC_CHDR) Channel 0 Disable Position */
#define AFEC_CHDR_CH0_Msk                   (_U_(0x1) << AFEC_CHDR_CH0_Pos)                /**< (AFEC_CHDR) Channel 0 Disable Mask */
#define AFEC_CHDR_CH0                       AFEC_CHDR_CH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH0_Msk instead */
#define AFEC_CHDR_CH1_Pos                   1                                              /**< (AFEC_CHDR) Channel 1 Disable Position */
#define AFEC_CHDR_CH1_Msk                   (_U_(0x1) << AFEC_CHDR_CH1_Pos)                /**< (AFEC_CHDR) Channel 1 Disable Mask */
#define AFEC_CHDR_CH1                       AFEC_CHDR_CH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH1_Msk instead */
#define AFEC_CHDR_CH2_Pos                   2                                              /**< (AFEC_CHDR) Channel 2 Disable Position */
#define AFEC_CHDR_CH2_Msk                   (_U_(0x1) << AFEC_CHDR_CH2_Pos)                /**< (AFEC_CHDR) Channel 2 Disable Mask */
#define AFEC_CHDR_CH2                       AFEC_CHDR_CH2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH2_Msk instead */
#define AFEC_CHDR_CH3_Pos                   3                                              /**< (AFEC_CHDR) Channel 3 Disable Position */
#define AFEC_CHDR_CH3_Msk                   (_U_(0x1) << AFEC_CHDR_CH3_Pos)                /**< (AFEC_CHDR) Channel 3 Disable Mask */
#define AFEC_CHDR_CH3                       AFEC_CHDR_CH3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH3_Msk instead */
#define AFEC_CHDR_CH4_Pos                   4                                              /**< (AFEC_CHDR) Channel 4 Disable Position */
#define AFEC_CHDR_CH4_Msk                   (_U_(0x1) << AFEC_CHDR_CH4_Pos)                /**< (AFEC_CHDR) Channel 4 Disable Mask */
#define AFEC_CHDR_CH4                       AFEC_CHDR_CH4_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH4_Msk instead */
#define AFEC_CHDR_CH5_Pos                   5                                              /**< (AFEC_CHDR) Channel 5 Disable Position */
#define AFEC_CHDR_CH5_Msk                   (_U_(0x1) << AFEC_CHDR_CH5_Pos)                /**< (AFEC_CHDR) Channel 5 Disable Mask */
#define AFEC_CHDR_CH5                       AFEC_CHDR_CH5_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH5_Msk instead */
#define AFEC_CHDR_CH6_Pos                   6                                              /**< (AFEC_CHDR) Channel 6 Disable Position */
#define AFEC_CHDR_CH6_Msk                   (_U_(0x1) << AFEC_CHDR_CH6_Pos)                /**< (AFEC_CHDR) Channel 6 Disable Mask */
#define AFEC_CHDR_CH6                       AFEC_CHDR_CH6_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH6_Msk instead */
#define AFEC_CHDR_CH7_Pos                   7                                              /**< (AFEC_CHDR) Channel 7 Disable Position */
#define AFEC_CHDR_CH7_Msk                   (_U_(0x1) << AFEC_CHDR_CH7_Pos)                /**< (AFEC_CHDR) Channel 7 Disable Mask */
#define AFEC_CHDR_CH7                       AFEC_CHDR_CH7_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH7_Msk instead */
#define AFEC_CHDR_CH8_Pos                   8                                              /**< (AFEC_CHDR) Channel 8 Disable Position */
#define AFEC_CHDR_CH8_Msk                   (_U_(0x1) << AFEC_CHDR_CH8_Pos)                /**< (AFEC_CHDR) Channel 8 Disable Mask */
#define AFEC_CHDR_CH8                       AFEC_CHDR_CH8_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH8_Msk instead */
#define AFEC_CHDR_CH9_Pos                   9                                              /**< (AFEC_CHDR) Channel 9 Disable Position */
#define AFEC_CHDR_CH9_Msk                   (_U_(0x1) << AFEC_CHDR_CH9_Pos)                /**< (AFEC_CHDR) Channel 9 Disable Mask */
#define AFEC_CHDR_CH9                       AFEC_CHDR_CH9_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH9_Msk instead */
#define AFEC_CHDR_CH10_Pos                  10                                             /**< (AFEC_CHDR) Channel 10 Disable Position */
#define AFEC_CHDR_CH10_Msk                  (_U_(0x1) << AFEC_CHDR_CH10_Pos)               /**< (AFEC_CHDR) Channel 10 Disable Mask */
#define AFEC_CHDR_CH10                      AFEC_CHDR_CH10_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH10_Msk instead */
#define AFEC_CHDR_CH11_Pos                  11                                             /**< (AFEC_CHDR) Channel 11 Disable Position */
#define AFEC_CHDR_CH11_Msk                  (_U_(0x1) << AFEC_CHDR_CH11_Pos)               /**< (AFEC_CHDR) Channel 11 Disable Mask */
#define AFEC_CHDR_CH11                      AFEC_CHDR_CH11_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHDR_CH11_Msk instead */
#define AFEC_CHDR_MASK                      _U_(0xFFF)                                     /**< \deprecated (AFEC_CHDR) Register MASK  (Use AFEC_CHDR_Msk instead)  */
#define AFEC_CHDR_Msk                       _U_(0xFFF)                                     /**< (AFEC_CHDR) Register Mask  */

#define AFEC_CHDR_CH_Pos                    0                                              /**< (AFEC_CHDR Position) Channel xx Disable */
#define AFEC_CHDR_CH_Msk                    (_U_(0xFFF) << AFEC_CHDR_CH_Pos)               /**< (AFEC_CHDR Mask) CH */
#define AFEC_CHDR_CH(value)                 (AFEC_CHDR_CH_Msk & ((value) << AFEC_CHDR_CH_Pos))  

