zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/afec.h
/* -------- AFEC_CHSR : (AFEC Offset: 0x1c) (R/ 32) AFEC Channel Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Status                         */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Status                         */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Status                         */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Status                         */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Status                         */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Status                         */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Status                         */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Status                         */
    uint32_t CH8:1;                     /**< bit:      8  Channel 8 Status                         */
    uint32_t CH9:1;                     /**< bit:      9  Channel 9 Status                         */
    uint32_t CH10:1;                    /**< bit:     10  Channel 10 Status                        */
    uint32_t CH11:1;                    /**< bit:     11  Channel 11 Status                        */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:12;                     /**< bit:  0..11  Channel xx Status                        */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CHSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CHSR_OFFSET                    (0x1C)                                        /**<  (AFEC_CHSR) AFEC Channel Status Register  Offset */

#define AFEC_CHSR_CH0_Pos                   0                                              /**< (AFEC_CHSR) Channel 0 Status Position */
#define AFEC_CHSR_CH0_Msk                   (_U_(0x1) << AFEC_CHSR_CH0_Pos)                /**< (AFEC_CHSR) Channel 0 Status Mask */
#define AFEC_CHSR_CH0                       AFEC_CHSR_CH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH0_Msk instead */
#define AFEC_CHSR_CH1_Pos                   1                                              /**< (AFEC_CHSR) Channel 1 Status Position */
#define AFEC_CHSR_CH1_Msk                   (_U_(0x1) << AFEC_CHSR_CH1_Pos)                /**< (AFEC_CHSR) Channel 1 Status Mask */
#define AFEC_CHSR_CH1                       AFEC_CHSR_CH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH1_Msk instead */
#define AFEC_CHSR_CH2_Pos                   2                                              /**< (AFEC_CHSR) Channel 2 Status Position */
#define AFEC_CHSR_CH2_Msk                   (_U_(0x1) << AFEC_CHSR_CH2_Pos)                /**< (AFEC_CHSR) Channel 2 Status Mask */
#define AFEC_CHSR_CH2                       AFEC_CHSR_CH2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH2_Msk instead */
#define AFEC_CHSR_CH3_Pos                   3                                              /**< (AFEC_CHSR) Channel 3 Status Position */
#define AFEC_CHSR_CH3_Msk                   (_U_(0x1) << AFEC_CHSR_CH3_Pos)                /**< (AFEC_CHSR) Channel 3 Status Mask */
#define AFEC_CHSR_CH3                       AFEC_CHSR_CH3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH3_Msk instead */
#define AFEC_CHSR_CH4_Pos                   4                                              /**< (AFEC_CHSR) Channel 4 Status Position */
#define AFEC_CHSR_CH4_Msk                   (_U_(0x1) << AFEC_CHSR_CH4_Pos)                /**< (AFEC_CHSR) Channel 4 Status Mask */
#define AFEC_CHSR_CH4                       AFEC_CHSR_CH4_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH4_Msk instead */
#define AFEC_CHSR_CH5_Pos                   5                                              /**< (AFEC_CHSR) Channel 5 Status Position */
#define AFEC_CHSR_CH5_Msk                   (_U_(0x1) << AFEC_CHSR_CH5_Pos)                /**< (AFEC_CHSR) Channel 5 Status Mask */
#define AFEC_CHSR_CH5                       AFEC_CHSR_CH5_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH5_Msk instead */
#define AFEC_CHSR_CH6_Pos                   6                                              /**< (AFEC_CHSR) Channel 6 Status Position */
#define AFEC_CHSR_CH6_Msk                   (_U_(0x1) << AFEC_CHSR_CH6_Pos)                /**< (AFEC_CHSR) Channel 6 Status Mask */
#define AFEC_CHSR_CH6                       AFEC_CHSR_CH6_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH6_Msk instead */
#define AFEC_CHSR_CH7_Pos                   7                                              /**< (AFEC_CHSR) Channel 7 Status Position */
#define AFEC_CHSR_CH7_Msk                   (_U_(0x1) << AFEC_CHSR_CH7_Pos)                /**< (AFEC_CHSR) Channel 7 Status Mask */
#define AFEC_CHSR_CH7                       AFEC_CHSR_CH7_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH7_Msk instead */
#define AFEC_CHSR_CH8_Pos                   8                                              /**< (AFEC_CHSR) Channel 8 Status Position */
#define AFEC_CHSR_CH8_Msk                   (_U_(0x1) << AFEC_CHSR_CH8_Pos)                /**< (AFEC_CHSR) Channel 8 Status Mask */
#define AFEC_CHSR_CH8                       AFEC_CHSR_CH8_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH8_Msk instead */
#define AFEC_CHSR_CH9_Pos                   9                                              /**< (AFEC_CHSR) Channel 9 Status Position */
#define AFEC_CHSR_CH9_Msk                   (_U_(0x1) << AFEC_CHSR_CH9_Pos)                /**< (AFEC_CHSR) Channel 9 Status Mask */
#define AFEC_CHSR_CH9                       AFEC_CHSR_CH9_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH9_Msk instead */
#define AFEC_CHSR_CH10_Pos                  10                                             /**< (AFEC_CHSR) Channel 10 Status Position */
#define AFEC_CHSR_CH10_Msk                  (_U_(0x1) << AFEC_CHSR_CH10_Pos)               /**< (AFEC_CHSR) Channel 10 Status Mask */
#define AFEC_CHSR_CH10                      AFEC_CHSR_CH10_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH10_Msk instead */
#define AFEC_CHSR_CH11_Pos                  11                                             /**< (AFEC_CHSR) Channel 11 Status Position */
#define AFEC_CHSR_CH11_Msk                  (_U_(0x1) << AFEC_CHSR_CH11_Pos)               /**< (AFEC_CHSR) Channel 11 Status Mask */
#define AFEC_CHSR_CH11                      AFEC_CHSR_CH11_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CHSR_CH11_Msk instead */
#define AFEC_CHSR_MASK                      _U_(0xFFF)                                     /**< \deprecated (AFEC_CHSR) Register MASK  (Use AFEC_CHSR_Msk instead)  */
#define AFEC_CHSR_Msk                       _U_(0xFFF)                                     /**< (AFEC_CHSR) Register Mask  */

#define AFEC_CHSR_CH_Pos                    0                                              /**< (AFEC_CHSR Position) Channel xx Status */
#define AFEC_CHSR_CH_Msk                    (_U_(0xFFF) << AFEC_CHSR_CH_Pos)               /**< (AFEC_CHSR Mask) CH */
#define AFEC_CHSR_CH(value)                 (AFEC_CHSR_CH_Msk & ((value) << AFEC_CHSR_CH_Pos))  

/* -------- AFEC_LCDR : (AFEC Offset: 0x20) (R/ 32) AFEC Last Converted Data Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LDATA:16;                  /**< bit:  0..15  Last Data Converted                      */
    uint32_t :8;                        /**< bit: 16..23  Reserved */
    uint32_t CHNB:4;                    /**< bit: 24..27  Channel Number                           */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_LCDR_Type;
