zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/afec.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CSELR_OFFSET                   (0x64)                                        /**<  (AFEC_CSELR) AFEC Channel Selection Register  Offset */

#define AFEC_CSELR_CSEL_Pos                 0                                              /**< (AFEC_CSELR) Channel Selection Position */
#define AFEC_CSELR_CSEL_Msk                 (_U_(0xF) << AFEC_CSELR_CSEL_Pos)              /**< (AFEC_CSELR) Channel Selection Mask */
#define AFEC_CSELR_CSEL(value)              (AFEC_CSELR_CSEL_Msk & ((value) << AFEC_CSELR_CSEL_Pos))
#define AFEC_CSELR_MASK                     _U_(0x0F)                                      /**< \deprecated (AFEC_CSELR) Register MASK  (Use AFEC_CSELR_Msk instead)  */
#define AFEC_CSELR_Msk                      _U_(0x0F)                                      /**< (AFEC_CSELR) Register Mask  */


/* -------- AFEC_CDR : (AFEC Offset: 0x68) (R/ 32) AFEC Channel Data Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DATA:16;                   /**< bit:  0..15  Converted Data                           */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CDR_OFFSET                     (0x68)                                        /**<  (AFEC_CDR) AFEC Channel Data Register  Offset */

#define AFEC_CDR_DATA_Pos                   0                                              /**< (AFEC_CDR) Converted Data Position */
#define AFEC_CDR_DATA_Msk                   (_U_(0xFFFF) << AFEC_CDR_DATA_Pos)             /**< (AFEC_CDR) Converted Data Mask */
#define AFEC_CDR_DATA(value)                (AFEC_CDR_DATA_Msk & ((value) << AFEC_CDR_DATA_Pos))
#define AFEC_CDR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (AFEC_CDR) Register MASK  (Use AFEC_CDR_Msk instead)  */
#define AFEC_CDR_Msk                        _U_(0xFFFF)                                    /**< (AFEC_CDR) Register Mask  */


/* -------- AFEC_COCR : (AFEC Offset: 0x6c) (R/W 32) AFEC Channel Offset Compensation Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t AOFF:10;                   /**< bit:   0..9  Analog Offset                            */
    uint32_t :22;                       /**< bit: 10..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_COCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_COCR_OFFSET                    (0x6C)                                        /**<  (AFEC_COCR) AFEC Channel Offset Compensation Register  Offset */

#define AFEC_COCR_AOFF_Pos                  0                                              /**< (AFEC_COCR) Analog Offset Position */
#define AFEC_COCR_AOFF_Msk                  (_U_(0x3FF) << AFEC_COCR_AOFF_Pos)             /**< (AFEC_COCR) Analog Offset Mask */
#define AFEC_COCR_AOFF(value)               (AFEC_COCR_AOFF_Msk & ((value) << AFEC_COCR_AOFF_Pos))
#define AFEC_COCR_MASK                      _U_(0x3FF)                                     /**< \deprecated (AFEC_COCR) Register MASK  (Use AFEC_COCR_Msk instead)  */
#define AFEC_COCR_Msk                       _U_(0x3FF)                                     /**< (AFEC_COCR) Register Mask  */


/* -------- AFEC_TEMPMR : (AFEC Offset: 0x70) (R/W 32) AFEC Temperature Sensor Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RTCT:1;                    /**< bit:      0  Temperature Sensor RTC Trigger Mode      */
    uint32_t :3;                        /**< bit:   1..3  Reserved */
    uint32_t TEMPCMPMOD:2;              /**< bit:   4..5  Temperature Comparison Mode              */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_TEMPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_TEMPMR_OFFSET                  (0x70)                                        /**<  (AFEC_TEMPMR) AFEC Temperature Sensor Mode Register  Offset */

#define AFEC_TEMPMR_RTCT_Pos                0                                              /**< (AFEC_TEMPMR) Temperature Sensor RTC Trigger Mode Position */
#define AFEC_TEMPMR_RTCT_Msk                (_U_(0x1) << AFEC_TEMPMR_RTCT_Pos)             /**< (AFEC_TEMPMR) Temperature Sensor RTC Trigger Mode Mask */
#define AFEC_TEMPMR_RTCT                    AFEC_TEMPMR_RTCT_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_TEMPMR_RTCT_Msk instead */
#define AFEC_TEMPMR_TEMPCMPMOD_Pos          4                                              /**< (AFEC_TEMPMR) Temperature Comparison Mode Position */
#define AFEC_TEMPMR_TEMPCMPMOD_Msk          (_U_(0x3) << AFEC_TEMPMR_TEMPCMPMOD_Pos)       /**< (AFEC_TEMPMR) Temperature Comparison Mode Mask */
#define AFEC_TEMPMR_TEMPCMPMOD(value)       (AFEC_TEMPMR_TEMPCMPMOD_Msk & ((value) << AFEC_TEMPMR_TEMPCMPMOD_Pos))
#define   AFEC_TEMPMR_TEMPCMPMOD_LOW_Val    _U_(0x0)                                       /**< (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_HIGH_Val   _U_(0x1)                                       /**< (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_IN_Val     _U_(0x2)                                       /**< (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_OUT_Val    _U_(0x3)                                       /**< (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window.  */
#define AFEC_TEMPMR_TEMPCMPMOD_LOW          (AFEC_TEMPMR_TEMPCMPMOD_LOW_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window. Position  */
#define AFEC_TEMPMR_TEMPCMPMOD_HIGH         (AFEC_TEMPMR_TEMPCMPMOD_HIGH_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window. Position  */
#define AFEC_TEMPMR_TEMPCMPMOD_IN           (AFEC_TEMPMR_TEMPCMPMOD_IN_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window. Position  */
#define AFEC_TEMPMR_TEMPCMPMOD_OUT          (AFEC_TEMPMR_TEMPCMPMOD_OUT_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window. Position  */
#define AFEC_TEMPMR_MASK                    _U_(0x31)                                      /**< \deprecated (AFEC_TEMPMR) Register MASK  (Use AFEC_TEMPMR_Msk instead)  */
#define AFEC_TEMPMR_Msk                     _U_(0x31)                                      /**< (AFEC_TEMPMR) Register Mask  */


/* -------- AFEC_TEMPCWR : (AFEC Offset: 0x74) (R/W 32) AFEC Temperature Compare Window Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TLOWTHRES:16;              /**< bit:  0..15  Temperature Low Threshold                */
    uint32_t THIGHTHRES:16;             /**< bit: 16..31  Temperature High Threshold               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_TEMPCWR_Type;
